Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/retirement/older_people_and_working/index.html.txt.tmx
Source language: en
Languages: ga

source: The effects of working in retirement on social welfare benefits, entitlement to pensions and employee protective legislation
ga: Tá cur síos anseo ar an tionchar a bhíonn ag obair tar éis dul amach ar phinsean ar shochair leasa shóisialaigh, cailíocht i gcomhair pinsin agus reachtú cosanta fostaithe

source: Age equality in employment
ga: Comhionannas aoise san fhostaíocht

source: The Employment Equality Acts 1998-2015 prohibit discrimination in employment on the grounds of age
ga: Cuireann na hAchtanna um Chomhionannas Fostaíochta 1998-2011 cosc ar leatrom a dhéanamh i gcúrsaí fostaíochta ar chúinsí faoi leith, aois san áireamh

source: Find out more about the conditions and rules that apply
ga: Faigh amach tuilleadh faoi na coinníollacha agus rialacha atá i bhfeidhm

source: There is no single fixed retirement age for employees
ga: Níl aon aois seasta amháin le dul amach ar phinsean d'fhostaithe

source: Find out about contracts of employment, mandatory retirement and self-employed people
ga: Faigh amach tuilleadh faoi chonarthaí fhostaíochta, dhul amach ar phinsean leagtha síos agus daoine féinfhostaithe

source: Most Read in "Employment"
ga: Ábhar is mó éilimh i "Fostaíocht"

source: Rest periods and breaks
ga: Tréimhsí sosa agus sosanna

source: Tax and starting work - PAYE
ga: Cáin agus tosú ar obair
